app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
	@new_entry = Entry.new
    @entries = Entry.all

INSERT INTO "entries" ("sender", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender", "Jeff"], ["message", "Welcome to Freedom Board"], ["created_at", "2018-03-16 06:40:03.080060"], ["updated_at", "2018-03-16 06:40:03.080060"]]
---
  def create
	if(entry_params["sender"] == '' and entry_params["message"] == '')
		respond_to do |format|
			format.html { redirect_to entries_path, notice: 'Entry was unsuccessfully created.' }
		end
	else
		buff = entry_params
		if(buff["sender"] == '')
			buff["sender"] = "Anonymous"
		end
		@entry = Entry.new(buff)
		respond_to do |format|
		  if @entry.save